# RbsElecCircuitWireNumHotsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecCircuitWireNumHotsParam Property
ParameterTypeId Class See Also
---
"# of Hot Conductors"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecCircuitWireNumHotsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecCircuitWireNumHotsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecCircuitWireNumHotsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace